export default function About() {
  const data = [
    {
      text: "พ.ศ. 2523  - สร้างอาคารหลังที่ 2 มีนักเรียนรวม 504 คน ครูประจำ 21 ท่าน ครูพิเศษ 5 ท่าน",
    },
    {
      text: " พ.ศ. 2524  - มีนักเรียนทั้งหมด 1,249 คน ครูประจำ 51 ท่าน ครูพิเศษ 7 ท่าน",
    },
    {
      text: "  พ.ศ. 2525  - นักเรียนระดับชั้น ปวช. รุ่นที่ 1 จบการศึกษา",
    },
    {
      text: " พ.ศ. 2526  - เปิดหลักสูตร ปวท. รับผู้จบ ม.6 หรือเทียบเท่า แผนกบัญชี การเงิน การธนาคาร เรียนเวลา 14.00-21.00 น. - ใช้ชื่อโรงเรียนใหม่ คือ ทคนิคบริหารธุรกิจกรุงเทพ รับนักเรียนเข้าเรียนในภาคแรกรวม 3 ห้อง และเพิ่มอีก 1 ห้อง",
    },
    {
      text: " พ.ศ. 2533  - อาจารย์ศิริ ทรัพย์สมบูรณ์ ได้แต่งเพลงของสถาบัน คือ เพลงมาร์ชเทคนิค และ บีทีแอดรำลึก ให้ น.ส.ชไมพร จูงกระโทก นักเรียนระดับชั้น ปวช. 2 เป็นผู้ขับร้อง",
    },
    {
      text: "พ.ศ. 2535  - สร้างอาคารใหม่เป็นอาคารคอนกรีตชั้นเดียว คือ อาคาร 4 เป็นห้องเรียนปรับอากาศ 10 ห้อง สำหรับระดับ ปวส.",
    },
    {
      text: "พ.ศ. 2542  - ได้รับรองมาตรฐานคุณภาพการศึกษาจากกระทรวงศึกษาธิการ ปี พ.ศ. 2542-2546",
    },
    {
      text: "พ.ศ. 2543  - จัดงาน แจกประกาศนียบัตร ให้ผู้จบการศึกษา ระดับ ปวส. ครั้งที่ 1 ณ โรงเรียนเทคนิคบริหารธุรกิจกรุงเทพ",
    },
    {
      text: "พ.ศ. 2548  - ผ่านการประเมินคุณภาพภายนอกของสถานศึกษา จากสำนักงานรับรองมาตรฐาน และประเมินคุณภาพการศึกษา (ส.ม.ศ.)",
    },
  ];
  return (
    <div className="container lg:w-250 w-fit h-full p-3 lg:mx-auto md:mx-auto">
      <div className="">
        <div className=" grid lg:grid-cols-3 grid-cols-1 gap-2">
          <div className="border rounded-4xl p-3 leading-6 text-gray-700">
            <p className="text-sky-700 text-2xl border-b font-black">
              เกี่ยวกับเรา
            </p>
            <div className="my-3">
              <p className="text-sky-500 text-lg font-black">ชื่อทางการ</p>
              <p>วิทยาลัยอาชีวศึกษาเทคนิคบริหารธุรกิจกรุงเทพ</p>
            </div>
            <div className="mb-3">
              {" "}
              <p className="text-sky-500 text-lg font-black">ชื่อภาษาอังกฤษ</p>
              <p>
                BANGKOK TECHNICAL OF BUSINESS ADMINISTRATION VOCATIONAL COLLEGE
              </p>
            </div>
            <div>
              <p className="text-sky-500 text-lg font-black">ชื่อย่อ</p>
              <p>B.T. Ad. (บี.ที.แอด)</p>
            </div>
            <div className="mb-3">
              {" "}
              <p className="text-sky-500 text-lg font-black">ก่อตั้ง</p>
              <p>24 พฤษภาคม 2522</p>
            </div>
            <div className="mb-3">
              {" "}
              <p className="text-sky-500 text-lg font-black">สีประจำโรงเรียน</p>
              <p>ฟ้า ขาว</p>
            </div>
            <div className="mb-3">
              {" "}
              <p className="text-sky-500 text-lg font-black">องค์สักการะ</p>
              <p>ท้าวมหาพรหม</p>
            </div>
          </div>
          <div className="border col-span-2 p-3 rounded-4xl">
            <p className="text-sky-700 text-2xl border-b font-black">
              ประวัติของวิทยาลัย
            </p>
            <p className="leading-6 text-gray-700 my-2">
              {" "}
              สถานที่ตั้ง เลขที่ 88 สุขุมวิท 73 แขวงพระโขนง เขตวัฒนา
              กรุงเทพมหานคร 10260 มีเนื้อที่ 6 ไร่ 90 ตารางวา เมื่อวันที่ 24
              พฤษภาคม 2522 ณ อาคารเลขที่ 88 สุขุมวิท 73
              ได้ก่อกำเนิดสถาบันอาชีวศึกษาขึ้น ชื่อว่า "กรุงเทพธุรกิจพณิชยการ"
              โดย ท่านอาจารย์อุดม แสงหิรัญ และ ท่านอาจารย์พิศมัย แสงหิรัญ
              มีความมุ่งมั่นที่จะให้การศึกษาและการฝึกอบรมเยาวชนของชาติ
              ให้มีความรู้
              และความสามารถในแขนงอาชีวศึกษาเพื่อเป็นพื้นฐานนำไปประกอบอาชีพ และ
              ค้นคว้าศึกษาต่อในระดับที่สูงขึ้น เป็นบุคคลที่อยู่ในสังคมได้ดี
              มีระเบียบวินัย มีคุณธรรม รับผิดชอบต่อตนเอง ครอบครัว และสังคม
              เปิดสอนประเภทวิชาพาณิชยกรรม ระดับ ปวช. แผนกบัญชี การขาย
              เปิดเรียนภาคเช้า ปีแรก เป็นอาคารเรียน 4 ชั้น มีนักเรียนรุ่นแรก 175
              คน โดยมีครูประจำ 10 ท่าน และ ครูพิเศษ 5 ท่าน
            </p>
            <p className="text-sky-500 text-lg font-black">เหตุการณ์สำคัญ</p>
            <p>{data.map((event,index)=>{
                return (
                    <p key={index} className="text-sm border-b my-1  ">{event.text}</p>
                )
            })}</p>
          </div>
        </div>
      </div>
    </div>
  );
}
